import React from 'react';

const Blog = () => {
    return (
        <div className=' container mt-5'>
            <div className='row'>

                <div className='col col-md-6'>

                    <h1 className='text-center text-danger' >Difference between authorization and authentication</h1>

                    <p className='mt-5'>প্রমাণীকরণ এবং অনুমোদন এলাকা ইউনিট উভয়ই জ্ঞান সুরক্ষার ক্ষেত্রে ব্যবহৃত হয় যা একটি স্বয়ংক্রিয় ডেটা সিস্টেমে সুরক্ষার অনুমতি দেয়। প্রতিটি এলাকা ইউনিট ভয়ঙ্করভাবে গুরুত্বপূর্ণ বিষয় সাধারণত অনলাইনে তার পরিষেবা পরিকাঠামোর মূল আইটেম হিসাবে সম্পর্কিত। যাইহোক, প্রতিটি পদ এলাকা ইউনিট সম্পূর্ণ ভিন্ন ধারণা সঙ্গে ভয়ঙ্করভাবে সম্পূর্ণ ভিন্ন. যদিও এটি সত্য যে তারা সাধারণত একটি সমতুল্য সরঞ্জামের সাথে একটি সমতুল্য প্রসঙ্গে নিযুক্ত হয়, তারা একটি থেকে সম্পূর্ণ আলাদা</p>
                    <br />
                    <br />
                    <p>প্রমাণীকরণ প্রক্রিয়ায়, সিস্টেমে অ্যাক্সেস প্রদানের জন্য ব্যবহারকারীদের পরিচয় পরীক্ষা করা হয়। অনুমোদন প্রক্রিয়া চলাকালীন, সংস্থানগুলি অ্যাক্সেস করার জন্য ব্যক্তি বা ব্যবহারকারীর কর্তৃপক্ষকে পরীক্ষা করা হয়। অনুমোদন প্রক্রিয়ার আগে প্রমাণীকরণ করা হয়, যেখানে অনুমোদন প্রক্রিয়াটি প্রমাণীকরণ প্রক্রিয়ার পরে করা হয়।</p>
                </div>

                <div className='col col-md-6'>
                    <h1 className='text-center text-success'>Why are you using firebase? What other options do you have to implement authentication?</h1>
                    <p className='mt-5'>ফায়ারবেস রিয়েলটাইম ডেটাবেস আপনাকে সরাসরি ক্লায়েন্ট-সাইড কোড থেকে ডাটাবেসে নিরাপদ অ্যাক্সেসের অনুমতি দিয়ে সমৃদ্ধ, সহযোগী অ্যাপ্লিকেশন তৈরি করতে দেয়। ডেটা স্থানীয়ভাবে বজায় থাকে, এবং অফলাইনে থাকাকালীনও, রিয়েলটাইম ইভেন্টগুলি অব্যাহত থাকে, যা শেষ ব্যবহারকারীকে একটি প্রতিক্রিয়াশীল অভিজ্ঞতা দেয়।
                    </p>
                    <br />
                    <p>সাধারণত, একটি সার্ভার দ্বারা প্রমাণীকরণ একটি ব্যবহারকারীর নাম এবং পাসওয়ার্ড ব্যবহার entails. প্রমাণীকরণের অন্যান্য উপায়গুলি কার্ড, রেটিনা স্ক্যান, ভয়েস রিকগনিশন এবং আঙ্গুলের ছাপের মাধ্যমে হতে পারে।
                    </p>
                </div>

            </div>

        </div>
    );
};

export default Blog;